sort/app/views/submissions/_form.html.haml

                      = link_to user.name, #
                      = user.databases.each do |database|
---
SELECT "databases".* FROM "databases" WHERE "databases"."user_id" = 1

                          %li{:id => database.id}
                            = link_to database.title + " ("+database.database_versions.length.to_s + " Versions  )", #
---
SELECT "database_versions".* FROM "database_versions" WHERE "database_versions"."database_id" = 2
SELECT "ions".* FROM "ions"