sort/app/views/databases/index.html.haml

    #active.active.tab-pane
      - if Database.where("enabled=?",true).count == 0
---
SELECT COUNT(*) FROM "databases" WHERE (enabled='t')