sort/app/controllers/databases_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "databases".* FROM "databases"
---
  def index
    # displaying databases, for an admin => show all
    # for any other user => show their own databases
    if ! current_user.admin?
        @databases = Database.where("user_id= ? and enabled=? ", User.current, true)
    else
       @databases = Database.all