sort/app/controllers/submissions_controller.rb

  def show
    @submission = Submission.find(params[:id])
---
SELECT "ions".* FROM "ions" WHERE "ions"."id" = 3 LIMIT 1
SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", "6"]]

  def new
    #myvar = test

    @database_verisons = DatabaseVersion.processed.all
    @databases = Database.find(:all)
    @users = User.where(:approved => true, :enabled => true)
---
SELECT "database_versions".* FROM "database_versions" WHERE "database_versions"."database_id" = 2
SELECT "ions".* FROM "ions"
SELECT "users".* FROM "users" WHERE "users"."approved" = 't' AND "users"."enabled" = 't'

  def create
    @submission = Submission.new(params[:submission])
    @submission.user = @user
    file = params[:submission][:file]


    # if params.include? :receive_email
    #   @submission.send_confirmation = true
    # else
    #   @submission.send_confirmation = false
    # end

    if (file && file.original_filename.end_with?(".zip"))
      create_multiple
      return
    end

		@submission.file = file

    respond_to do |format|
      if @submission.save
---
INSERT INTO "submissions" ("created_at", "database_title", "database_version_id", "e_value_cutoff", "email", "enzyme_id", "error_message", "file", "file_extension", "fract_prod_peaks", "hitlist_max_length", "ints_peaks", "ion_1_id", "ion_2_id", "l_bound_precursor", "max_missed_cleavages", "max_var_mods", "min_charge", "output_filetype", "output_type", "peak_cutoff", "precursor_mass_search_type", "precursor_mass_tolerance", "product_mass_search_type", "product_mass_tolerance", "result", "results_file", "send_confirmation", "status", "title", "u_bound_precursor", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)