sort/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."admin" = 't'
SELECT "users".* FROM "users" WHERE "users"."approved" = 'f'
SELECT "users".* FROM "users" WHERE "users"."admin" = 'f' AND "users"."approved" = 't' AND "users"."enabled" = 't'
SELECT "users".* FROM "users" WHERE "users"."enabled" = 'f' AND "users"."approved" = 't'
---
  def index
    @users_admin = User.find_all_by_admin(true)
    @users_inactive = User.find_all_by_approved(false)
    @users_active = User.where(:admin => false, :approved => true, :enabled => true)
    @users_disabled = User.where(:enabled => false, :approved => true)